#include <stdio.h>

void Array() {

	// int arr[z][y][x] 순
	// 1차원 배열
	int arr[3];
	// ㅁㅁㅁ

	// 2차원 배열 
	int arr2[2][5];
	/*
		ㅁㅁㅁㅁㅁ
		ㅁㅁㅁㅁㅁ
	*/
	int arr3[4][2]; // 배열 = 8개
	/*
		ㅁㅁ
		ㅁㅁ
		ㅁㅁ
		ㅁㅁ
	*/

	// { [0,0],[0,1],
	//	[1,0],[1,1],
	//	[2,0],[2,1],
	//	[3,0],[3,1]
	//	}

	// 3차원 배열
	int arr4[3][3][3];
	/*
		ㅁㅁㅁ
		ㅁㅁㅁ
		ㅁㅁㅁ
	*/

	int arr5[5] = { 1,2,3,4,5 };
	int arr6[2][5] = { 
						{ 1,2,3,4,5 }, 
						{ 1,2,3,4,5 } 
					};
	int arr7[4][2] = { 
						{1,2},
						{1,2},
						{1,2},
						{1,2} 
					};

	// ========================== key point !! 
	for (int i = 0; i < 4; i++)
	{

		for (int j = 0; j < 2; j++)
		{
			printf("2차원 배열 [%d][%d]의 값 %d\n", i,j, arr7[i][j]);
		}
		printf("\n");
	}


	int arr8[3][3][3] = { {{3,3,3},{3,3,3},{3,3,3}},
						{{3,3,3} ,{3,3,3} ,{3,3,3}},
						{{3,3,3} ,{3,3,3} ,{3,3,3}} };




}